import React from "react";

export const Introduction = () => {
  return (
    <div>
      <p>
        React, Typescript 기반의 7년차 프론트엔드 엔지니어로 일하고 있으며,
        영업사원을 위한 배정시스템 개발 및 운영을 담당하고 있습니다. 상호간
        적극적인 소통을 통해 이슈를 제기하고 해결하며 성취감을 느끼고 있습니다.
        주도적인 업무를 진행할 수 있는 환경을 선호합니다.
      </p>

      <h3>B2C, 어드민 서비스의 전문성을 갖췄습니다.</h3>
      <p>
        코웨이에서 5년간 6개의 서비스를 구축 및 운영하였습니다. 기술 스택부터
        선정해 아키텍처 구조 설계한 경험이있습니다. '통합회원'에서 안정적인 운영
        업무와 마이그레이션 이후 회원수 300K명, MAU 5K명을 달성했으며, 미국
        신사업 어드민에서 서비스 1년 개발기간을 거쳐 성공적인 오픈과 데이터독
        검증을 통해 FCP/LCP 지연 구간을 최대 33%개선한 경험이 있습니다.
      </p>

      <h3>'다양한 경험'을 통해 저 자신의 강점을 강화시키고 있습니다.</h3>
      <p>
        AX 챌린지를 통해 AX함양을 쌓아가고 있고, 파트에 로컬 RAG와 하네스 구조,
        퍼블리싱 스킬을 추가하여 에이전트 코딩 정확도를 높이고 있습니다. 또한,
        퍼블리싱 내재화를 통해 간단한 퍼블리싱 작업을 내재화하여 외주비용을
        최소화 하는데 기여했습니다.
      </p>

      <h3>소통을 통해 서비스 품질을 높여왔습니다.</h3>
      <p>
        '적극적인 소통'은 개발 오류방지와 서비스 품질을 강화하는데 있어 가장
        중요하다고 생각합니다. FE간의 기술 스택을 선정하는데 있어 소통을
        거듭하여 의견 공유 및 반영하여 코드품질을 높이고 있습니다. '데이터독
        RUM'을 연동하여 기획 및 백엔드와 적극적인 소통으로 언급되지 않던
        병목구간을 찾아 이슈업을 하여 해결하고 있습니다.
      </p>
    </div>
  );
};
